wisteria-1c/Конфигурация/InformationRegisters/ПодключениеКомбинированныхПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПодключениеКомбинированныхПриложений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусКомбинированногоПриложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/СтатусКомбинированногоПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусКомбинированногоПриложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗарегистрированоОбновление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарегистрированоУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользовалось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ПодключениеКомбинированныхПриложений/Forms/СтатусПриложений/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	ВывестиБаннеры();
	
	Если Не ВозможностиПриложения.ЭтоБизнесПриложение() Тогда
		Элементы.Баннер.Видимость = Истина;
		КоманднаяПанель.Доступность = Ложь;
		Элементы.ГруппаСтатусыПриложений.Доступность = Ложь;
	Иначе
		Элементы.Баннер.Видимость = Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.РазделениеВключено()
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Элементы.СтатусПриложенийЗапуститьРегламентноеЗадание.Видимость = Истина;
	КонецЕсли;
	
	Элементы.Список.ТолькоПросмотр = Истина;
	ЗаполнитьСтатусыПриложений();
	
	Если ЭтоИнтерфейсТакси Тогда
		УстановитьУсловноеОформление();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	Элементы.Список.ТолькоПросмотр = Ложь;
	Элементы.СписокВключитьВозможностьРедактирования.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьПриложение(Команда)
	
	Если Элементы.СтатусПриложений.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПриложения = Элементы.СтатусПриложений.ТекущиеДанные.ИмяПриложения;
	ПодключитьПриложениеНаСервере(ИмяПриложения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьПриложение(Команда)
	
	Если Элементы.СтатусПриложений.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПриложения = Элементы.СтатусПриложений.ТекущиеДанные.ИмяПриложения;
	ОтключитьПриложениеНаСервере(ИмяПриложения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбновлениеПриложений(Команда)
	ВыполнитьОбновлениеПриложенийНаСервере();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРегламентноеЗадание(Команда)
	ЗапуститьРегламентноеЗаданиеНаСервере();  
	Обновить("");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиБаннеры()
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Подключение/отключение приложений доступно только в ""Комбинированном"" виде приложения конфигурации'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'ru = Это не бизнес-приложение'");
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.Баннер);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПодключитьПриложениеНаСервере(ИмяПриложения)
	
	РегистрыСведений.ПодключениеКомбинированныхПриложений.ЗарегистрироватьСобытие(ИмяПриложения, Перечисления.СтатусКомбинированногоПриложения.ЗарегистрированоОбновление);
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьПриложениеНаСервере(ИмяПриложения)
	
	РегистрыСведений.ПодключениеКомбинированныхПриложений.ЗарегистрироватьСобытие(ИмяПриложения, Перечисления.СтатусКомбинированногоПриложения.ЗарегистрированоУдаление);
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	Элементы.Список.Обновить();
	ЗаполнитьСтатусыПриложений();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыПриложений()
	
	СтатусПриложений.Очистить();
	ПолученоСтатусПриложений = РегистрыСведений.ПодключениеКомбинированныхПриложений.СтатусПриложений();
	Для каждого Строка Из ПолученоСтатусПриложений Цикл
		НоваяСтрока = СтатусПриложений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбновлениеПриложенийНаСервере()
	
	ПриложенияДляОтключения = РегистрыСведений.ПодключениеКомбинированныхПриложений.ПриложенияДляОтключения();
	Для каждого ОписаниеПриложения Из ПриложенияДляОтключения Цикл
		ОписаниеСобытия = НСтр("ru='Пользователь инициировал отключение приложения ""%1"".'");
		ОписаниеСобытия = СтрШаблон(ОписаниеСобытия, ОписаниеПриложения.Имя);
		ТарификацияБизнес.ОбработатьОтключениеПриложения(ОписаниеПриложения, ОписаниеСобытия, Ложь);
	КонецЦикла;
	
	ПриложенияДляПодключения = РегистрыСведений.ПодключениеКомбинированныхПриложений.ПриложенияДляПодключения();
	Для каждого ОписаниеПриложения Из ПриложенияДляПодключения Цикл
		ПриложениеМожетБытьПодключено = ТарификацияБизнес.ПриложениеМожетБытьПодключено(ОписаниеПриложения);
		Если ПриложениеМожетБытьПодключено.Результат Тогда
			ОписаниеСобытия = НСтр("ru='Пользователь инициировал подключение приложения ""%1"".'");
			ОписаниеСобытия = СтрШаблон(ОписаниеСобытия, ОписаниеПриложения.Имя);
			ТарификацияБизнес.ОбработатьПодключениеПриложения(ОписаниеПриложения, ОписаниеСобытия, Ложь);
		Иначе
			ТекстОшибки = НСтр("ru='Приложение ""%1"" не может быть подключено по причине: %2'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, ОписаниеПриложения.Имя, ПриложениеМожетБытьПодключено.Причина);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьРегламентноеЗаданиеНаСервере()
    ТарификацияБизнес.АктуализироватьСостояниеПодписок();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	СоответствиеСтатусовИЦветов = Новый Соответствие;
	СоответствиеСтатусовИЦветов.Вставить(Перечисления.СтатусКомбинированногоПриложения.Подключено, ЦветаПалитры.Зеленый);
	СоответствиеСтатусовИЦветов.Вставить(Перечисления.СтатусКомбинированногоПриложения.Отключено, ЦветаПалитры.Красный);
	СоответствиеСтатусовИЦветов.Вставить(Перечисления.СтатусКомбинированногоПриложения.НеИспользовалось, ЦветаПалитры.Серый);
	СоответствиеСтатусовИЦветов.Вставить(Перечисления.СтатусКомбинированногоПриложения.ЗарегистрированоУдаление, ЦветаПалитры.Оранжевый);
	СоответствиеСтатусовИЦветов.Вставить(Перечисления.СтатусКомбинированногоПриложения.ЗарегистрированоОбновление, ЦветаПалитры.Голубой);
	
	Для Каждого СоответствиеСтатусаИЦвета Из СоответствиеСтатусовИЦветов Цикл
		
		НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
		РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
		НовоеУсловноеОформление.Отбор,
		"СтатусПриложений.Статус", СоответствиеСтатусаИЦвета.Ключ, ВидСравненияКомпоновкиДанных.Равно);
		
		ОформляемыеПоля = Новый Массив;
		ОформляемыеПоля.Добавить(Элементы.СтатусПриложенийСтатус.Имя);
		РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
		
		РаботаСФормой.ДобавитьЭлементУсловногоОформления(
		НовоеУсловноеОформление, "ЦветФона", СоответствиеСтатусаИЦвета.Значение);
		
		НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
		РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
		НовоеУсловноеОформление.Отбор,
		"Список.Статус", СоответствиеСтатусаИЦвета.Ключ, ВидСравненияКомпоновкиДанных.Равно);
		
		ОформляемыеПоля = Новый Массив;
		ОформляемыеПоля.Добавить(Элементы.Статус.Имя);
		РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
		
		РаботаСФормой.ДобавитьЭлементУсловногоОформления(
		НовоеУсловноеОформление, "ЦветФона", СоответствиеСтатусаИЦвета.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
